#pragma once

// Generated For PUBGM NOTE : OUR OLD CHANNEL HAS BEEN BANNED PLEASE JOIN THE NEW ONE !! T.ME/ONLYY_DEVS (3.8.0) 
//SDK GENERATED BY @D_V_4

namespace SDK
{
//---------------------By ARMP---------------------------
//Script Structs
//---------------------By ARMP---------------------------

// UserDefinedStruct BP_STRUCT_UGCDelayPublishConfig_type.BP_STRUCT_UGCDelayPublishConfig_type
// 0x0034
struct FBP_STRUCT_UGCDelayPublishConfig_type
{
	int                                                AssetID_0_090D47806B340C5C5C00CB1409B0E164;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_1_60C867805D709E046D552A1901929BC4;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     OpenDate_2_510CE84021F8F50171F88D14073034D5;              // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DelayType_3_11B5288025476E1C029A581C0BA71BD5;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsIconTimerShown_4_3698D9805D5659C2294AF5E700A66C8E;      // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ExpiredDate_6_4C5158004372B326409AD15601055885;           // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsResourceAllowedInPak_7_25572C006841D8740890B1C80CF6312B;// 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

