#pragma once

// Generated For PUBGM NOTE : OUR OLD CHANNEL HAS BEEN BANNED PLEASE JOIN THE NEW ONE !! T.ME/ONLYY_DEVS (3.8.0) 
//SDK GENERATED BY @D_V_4

namespace SDK
{
//---------------------By ARMP---------------------------
//Script Structs
//---------------------By ARMP---------------------------

// UserDefinedStruct BP_STRUCT_UGCAssetConfig_type.BP_STRUCT_UGCAssetConfig_type
// 0x00A8
struct FBP_STRUCT_UGCAssetConfig_type
{
	int                                                AssetID_0_6C1CB6005152E2225E501F6100A93244;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     Desc_1_4A0392802C18CB063DA2123E0FA92C93;                  // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_4_5F44160067247D64681C18D9000FA954;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	struct FString                                     Name_5_03E393000E13964C3DBD91440FAAC835;                  // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        ResArray_a_6_4341AD00601787C843D1519007308321;            // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ResSeprateType_7_1E557AC007537C097EC0E2E7042CEFE5;        // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	struct FString                                     HDIcon_8_674B1800689BD6DA2E2595D20948F7FE;                // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Icon_9_37F8B50009EF18043DB023720FA97A5E;                  // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             DependBundleArray_as_10_797669C001963C1D601E4B0701B83DB3; // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DeviceType_11_0A546F401898C3D950674F5B0033ACA5;           // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SortWeight_12_7D47F6C00275F1AF0A31276A0673DB64;           // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TabID_14_3C985BC06772649D7ABBFE950A827624;                // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	TArray<int>                                        Tags_a_15_3AC9E68016D9AB7C6FD004200827E8F1;               // 0x0088(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DependRes_16_7BC031405DB75F8B19962750065E0A03;            // 0x0098(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

