#pragma once

// Generated For PUBGM NOTE : OUR OLD CHANNEL HAS BEEN BANNED PLEASE JOIN THE NEW ONE !! T.ME/ONLYY_DEVS (3.8.0) 
//SDK GENERATED BY @D_V_4

namespace SDK
{
//---------------------By ARMP---------------------------
//Script Structs
//---------------------By ARMP---------------------------

// UserDefinedStruct BP_STRUCT_ParticleEmoteCfg_type.BP_STRUCT_ParticleEmoteCfg_type
// 0x0014
struct FBP_STRUCT_ParticleEmoteCfg_type
{
	int                                                EmoteID_0_259976C0104BBE7F4C6550940BC271C4;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                EmoteIDLevel2_1_7BF2C14005A553F56F1334C004EEBA32;         // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Level_2_072E93006DBB4F16078F1DD70823486C;                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UpgradeItemID_3_1FD0AE005137348430DF9D4205E0FE74;         // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UpgradeItemNum_4_293176C059E2020B78C7B7660E0FFFED;        // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

