#pragma once

// Generated For PUBGM NOTE : OUR OLD CHANNEL HAS BEEN BANNED PLEASE JOIN THE NEW ONE !! T.ME/ONLYY_DEVS (3.8.0) 
//SDK GENERATED BY @D_V_4

namespace SDK
{
//---------------------By ARMP---------------------------
//Script Structs
//---------------------By ARMP---------------------------

// UserDefinedStruct BP_STRUCT_MilestoneConfig_type.BP_STRUCT_MilestoneConfig_type
// 0x00BC
struct FBP_STRUCT_MilestoneConfig_type
{
	struct FString                                     EmoteID_20_178CC8C014579BB52492BEDF02AA0634;              // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_1_6893EA400F8021A76EBA41290ACAFE74;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Type_2_6EC38F8019E523BE2CF41B750AFF2AA5;                  // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     EntryDec1_18_20181AC05821A53D4802106A07324991;            // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EntryDec2_15_20191B005821A53E4802106907324992;            // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EntryName1_14_19CF58003511CB3E76AF7907033A6CF1;           // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EntryName2_17_19D058403511CB3F76AF7904033A6CF2;           // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     UPIcon_7_3FD1528054D3AAC02CD4CB390F0E34AE;                // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EntryDec3_16_201A1B405821A53F4802106807324993;            // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EntryName3_19_19D158803511CB4076AF7905033A6CF3;           // 0x0078(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EntryIcon1_10_51737A00494CBA8676FB14260321CB61;           // 0x0088(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EntryIcon2_11_51747A40494CBA8776FB14270321CB62;           // 0x0098(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EntryIcon3_12_51757A80494CBA8876FB14200321CB63;           // 0x00A8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                JumpPage_13_31D0ED403A864BC77F35E6E2028F9865;             // 0x00B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

